In [63]:
# CF notes:  before handing off for students check for the following:
    # SOLUTION - means I left my solution so let's remove that
    # WIP - means I have an idea, but execution or relevance not all figured out yet

# Welcome to the Data Manipulation Lesson.

In this lesson, we will be using this workbook in tandum with the reading assignments.

The workbook has been broken up into sections.  Each section has an article for you to read, be presented with a few questions to check your understanding, and code for you to work with related to the reading topics.

Note: The dataset you will be using with each exercise is not the dataset in the article.

In [64]:
import pandas as pd
import numpy as np
import seaborn as sns
from  scipy import stats

data= pd.read_csv("titanic.csv")


# import all the things here

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [65]:
# Run the head of your data set here:
#data.head()
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

# A. Aggregation

1. Please read the following:
    - [Python | Pandas dataframe.aggregate()](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/)
    - [Python | Pandas dataframe.groupby()](https://www.geeksforgeeks.org/python-pandas-dataframe-groupby/)
1. Answer the Check Your Understanding Questions
1. Work through the section Exercises

### Check Your Understanding:

Using the titanic dataset

1. What is the syntax for multiple aggregation functions acrosss a single column, such as 'age'?
    - **data.agg({"age":["sum", "mean"]})** 
    - 

1. What data type is the syntax using?
    - dictionary
    - 
1. What is this line of doing with the data? **data_group = data.groupby("embark_town")**
    - grouping by the town embarked
    - 
    
1.  What is this line of data doing? **data_group = data.groupby("embark_town").agg("mean")**
    - grouping the mean only of the other columns based on embarkment

In [66]:
# 1. Using the titanic data set, groupby "embark_town".

# 1a. Create a variable that will represent the grouping of data.
# 1b. Intitalize it using the groupby() function and pass it the column.
data_group = data.groupby("embark_town")   #SOLUTION

# To view the grouped data as a table, use the variable_name.first()
data_group.first() #SOLUTION

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,yes,False
Queenstown,0,3,male,2.0,0,0,8.4583,Q,Third,man,True,C,no,True
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,no,False

In [67]:
# Using your variable, method chain head() and agg().  
# Pass one of the following statistical values to agg: 
    # 'sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last':
    
data_group.head().agg("mean")    #SOLUTION


#Things to Think about:
# How does the data look when you pass "sum" vs when you pass "mean" to agg()?
#Note:  agg() and aggregate() are identical

survived       0.588235
pclass         2.235294
age           31.750000
sibsp          0.470588
parch          0.058824
fare          28.997300
adult_male     0.352941
alone          0.705882
dtype: float64

In [68]:
# 2. Next, apply aggregation across muliple columns using dictionary functionality.

# ---- Notes on Dictionaries. ----
# A dictionary is a Python collection type.  

age_dictionary={"age":["sum", "max"]}
    
    #It has a single key, "age", and a list of values, "sum", "max", "last".
    #This structure is called "Key-Value-Pair" and is how you can organize and manipulate dictionary objects.
    #Like lists, dictionaries are mutable.

    #In this example we are going to make a new variable, "dictionary_group", 
        #and set it equal to our aggreated dataset.
    #We passed our dictionary object to agg().  
    #The values here, reflect the aggregation operations we want to preform on the age column.

dictionary_agg=data.agg(age_dictionary)
dictionary_agg

# ---- End of Note ----

# 2a. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.

# Create a variable to hold at least 3 columns. 
    #Aggregate the following:  col 1: "sum" & "count"; col 2: "std" & "min", and col 3: "count" & "sum"
    

    
#SOLUTION - see article 1 for syntax

          age
sum  21205.17
max     80.00

In [69]:
#Groupby and Basic Math

In [70]:
# 3.  Let's now add Groupby to our Aggregation.
# Let's group by the 'pclass'.  Create a variable to hold your grouped data, like we did in question 1.

#passenger_class=

passenger_class = data.groupby(['pclass'])  #SOLUTION

#passenger_class.first() #<-- use first() here instead of head()

In [71]:
#4. We want to do muliple aggregation functions to our newly grouped data set
# We created a variable to hold a list of functions from the agg function.
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']

#Apply the agg function to our passenger_class variable.  Then pass our list to the function.
passenger_class.agg(agg_func_list)   #SOLUTION

       survived                                                                \
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630      1   0   1  0.484026  0.234281     1    1   216
2            87  0.472826      0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363      0   0   1  0.428949  0.183998     0    0   491

        ... alone                                                           \
        ...   sum      mean median    min   max       std       var  first
pclass  ...
1       ...   109  0.504630   True  False  True  0.501140  0.251141  False
2       ...   104  0.565217   True  False  True  0.497081  0.247090  False
3       ...   324  0.659878   True  False  True  0.474233  0.224897  False


        last count
pclass
1       True   216
2       True   184
3       True   491

[3 rows x 70 columns]

In [72]:
# 5.  Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  
# We can create a variable to hold a dictionary for the age column.  the Key would be "age" and the values are the functions from the agg function.
# It would look like this:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
passenger_class.agg(agg_func_dict)  #SOLUTION

# 5a.  Looking at this syntax, create a dictionary variable for the "survived" column and pass it to passenger_class.agg():
# Code it here:



#SOLUTION ---
# agg_func_dict = {
#     'survived':
#     ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
# }
# passenger_class.agg(agg_func_dict)

            age                                                             \
            sum       mean median   min   max        std         var first
pclass
1       7111.42  38.233441   37.0  0.92  80.0  14.802856  219.124543  38.0
2       5168.83  29.877630   29.0  0.67  70.0  14.001077  196.030152  14.0
3       8924.92  25.140620   24.0  0.42  74.0  12.495398  156.134976  22.0


        last count
pclass
1       26.0   186
2       27.0   173
3       32.0   355

In [73]:
# AGG WITH TEXT ------------- tier 3
# agg_func_dict = {
#     'deck':
#     [stats.mode, set]
# }
# passenger_class.agg(agg_func_dict)

# Creating New Variables ------

Reading:
1. [How to create new columns derived from existing columns?](https://pandas.pydata.org/docs/getting_started/intro_tutorials/05_add_columns.html)
1.[Recode Data](https://pythonfordatascienceorg.wordpress.com/recode-data/)

Suggested Reading:
- [How to manipulate textual data?](https://pandas.pydata.org/docs/getting_started/intro_tutorials/10_text_data.html)

In [74]:
### Plans for this section

#1.  convert fare prices then to an estimate of today (in pounds)
    # converseion resource: https://www.in2013dollars.com/uk/inflation/1912?amount=1
#2. Use function to recode series data (reading # 2) 
#3. Create new column of age groups (reading # 2) and 2 diff plots

In [75]:
# Using https://pandas.pydata.org/docs/getting_started/intro_tutorials/05_add_columns.html

data["fare_2021"] = (data["fare"] * 117.17)  #SOLUTION

In [76]:
# move the column closer to fare for better comparison  ##WIP

In [77]:
# Work with rename

#have student rename either "who" or "adult_male" as using a function
#data["who"] = data["who"].replace({"man":0, "woman":1})

def set_sex_to_number(series):
    if series == "man":
        return 0
    else:
        return 1
    
data["who"] = data["who"].apply(set_sex_to_number) # SOLUTION

In [82]:
#SOLUTION
# Create new column to check age groups

def age_groups(series):
    if series <20:
        return "0-19 years"
    elif 20 <= series < 30:
        return "20-29"
    elif 30 <= series < 40:
        return "30-39 years"
    elif 40 <= series < 50:
        return "40-49"
    elif 50 <= series < 60:
        return "50-59"
    else:
        return "over 60"
    
data["age_group"] = data["age"].apply(age_groups)  #SOLUTION

In [83]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,fare_2021,age_group
0,0,3,male,22.0,1,0,7.2500,S,Third,0,True,NaN,Southampton,no,False,849.482500,20-29
1,1,1,female,38.0,1,0,71.2833,C,First,1,False,C,Cherbourg,yes,False,8352.264261,30-39 years
2,1,3,female,26.0,0,0,7.9250,S,Third,1,False,NaN,Southampton,yes,True,928.572250,20-29
3,1,1,female,35.0,1,0,53.1000,S,First,1,False,C,Southampton,yes,False,6221.727000,30-39 years
4,0,3,male,35.0,0,0,8.0500,S,Third,0,True,NaN,Southampton,no,True,943.218500,30-39 years

In [86]:
# plot age group vs a col of their choice
# WIP

# For Merge/Join

In [79]:
#THIS WILL BE FOR THE MERGE/JOIN Section for the moment -------------------------


#merging two datasets side by side
df1 = pd.DataFrame({'Name':['Willow','Alyce','Steve','Hazel', 'Ivan', 'Beatrice', 'Skeeter', 'Bruce', 'BunBun','Alex','Behr', 'Rocket', 'Peanut'],
                      'ID':['22','34','77','35', '12','89', '21','76','45','32','11','09','01'],
                 'Species':['Dog','Cat','Cat','Rat', 'Rat', 'Cat', 'Cat', 'Horse','Rabbit', 'Dog', 'Dog', 'Dog', 'Dog'],
                    'Age':[6, 17, 14, 2, 2, 12, 18, 37, 5, 13, 9, 4, 2 ]})
df2 = pd.DataFrame({'Rabies_Status':["True", "True", "True","","","True", "False", "True","","False", "False", "True", "True" ],
                    'Last_Visit':[2021, 2021, 2021, 2020, 2018, 2021, 2017, 2021, 2004, 2009, 2021, 2021, 2021  ],
                  'Clinic_ID':['22','34','77','35', '12','89', '21','76','45','32','11','09','01']})
df = pd.merge(df1,df2, left_on = 'ID', right_on='Clinic_ID',validate='m:1', how='inner', indicator=True)
df
#once you've merged your dataset you are free to drop one of the repeated columns as long as they are similar
#df.drop('Clinic_ID', axis=1)

        Name  ID Species  Age Rabies_Status  Last_Visit Clinic_ID _merge
0     Willow  22     Dog    6          True        2021        22   both
1      Alyce  34     Cat   17          True        2021        34   both
2      Steve  77     Cat   14          True        2021        77   both
3      Hazel  35     Rat    2                      2020        35   both
4       Ivan  12     Rat    2                      2018        12   both
5   Beatrice  89     Cat   12          True        2021        89   both
6    Skeeter  21     Cat   18         False        2017        21   both
7      Bruce  76   Horse   37          True        2021        76   both
8     BunBun  45  Rabbit    5                      2004        45   both
9       Alex  32     Dog   13         False        2009        32   both
10      Behr  11     Dog    9         False        2021        11   both
11    Rocket  09     Dog    4          True        2021        09   both
12    Peanut  01     Dog    2          True        2021        01   both

In [80]:
# TODO:  Provide context for dataset

#